var objs = [
  {
      header:'Елена Мелехина',
      content:'<p>Внедрение системы облегчило и нашу работу, и работу депутатов. Окончательный уход от бумажных носителей экономит нам много времени. Раньше мы развозили документы депутатам в папочках. А сейчас достаточно зайти в систему, выложить документы, которые необходимы для заседания, и любой депутат может с ними предварительно ознакомиться.</p><p>Также программа позволяет нам просматривать документы со всех районов, которые работают с системой «Нормосфера».</p>',
      footer:'главный специалист отдела организационно-правового обеспечения аппарата Земского Собрания Ординского муниципального района'
  },
  {
      header:'Михаил Шипулин',
      content:'<p>Преимущество системы в том, что можно круглосуточно в режиме удаленного доступа работать с нормативно-правовыми актами и сопроводительными документами. В системе уже заложена вся нормативная база с 2008 года. Мы можем обратиться к ней в любое время, найти нужные данные и работать с ними.</p><p>Можно работать как со стационарного компьютера, так и с любого мобильного устройства. Когда я еду в командировку, беру с собой планшет и работаю в автомобиле. При наличии соединения с Интернет документ можно скопировать и дальше работать с ним уже без доступа к сети.</p><p>Также достоинствами системы я считаю уменьшение бумажного документооборота, быстрый поиск необходимой информации и возможность получать информацию в реальном времени.</p><p>Мы предложили работать с этой системой Администрации района, раздали логины и пароли и прокуратуре, чтоб не возить им бумажные носители. Предложили работать с системой Главам поселений. Разработчик пошел нам навстречу и теперь у каждого Главы поселения есть логин и пароль. Они могут посмотреть документы, которые мы прорабатываем сегодня на Земском Собрании.</p><p>Система очень удобная, простая в использовании. Рекомендую другим представительным органам у себя на местах внедрять ее и использовать. Нужно не стоять на месте, шагать дальше и двигаться вперед.</p>',
      footer:'председатель Земского собрания Ординского муниципального района'
  },
  {
      header:'Сергей Генеральчук',
      content:'<p>Сегодня мы работаем только на планшетах. Бумагу убрали вообще. Повестка есть, а все остальное в планшетах. Не буду лукавить, не скажу, что все прошло идеально. Некоторые люди работали по 3 созыва и привыкли иметь большие стопы бумаг, оставлять там заметки и т.д. Переход на электронный документооборот, как и любая инновация, у этих людей сначала вызвал определенное отторжение. Ничего. Прошло 2-3 месяца и никто сегодня уже вопросов не задает. Но плюсов гораздо больше.</p><p>В прокуратуру мы уже пачки документов не отвозим. Мы им пишем: «Уважаемый прокурор, документы размещены в системе». Все. Никаких приложений, ничего. И они с огромным удовольствием работают.</p><p>По электронной почте мы сейчас уже ничего не рассылаем. Все хранится в системе. Во-первых, можно посмотреть в режиме реального времени. Во-вторых, со всеми сопутствующими документами: приложениями к бюджетам, пояснительными записками, заключениями Контрольно-счетной палаты и т.д.</p><p>И я уже не говорю о том, что где бы человек не был, он может зайти в систему и посмотреть. А с теми документами, которые он к себе закачал, может работать даже там, где нет подключения к сети Интернет.</p><p>В этой информационной системе все продумано.</p>',
      footer:'председатель Земского собрания Осинского муниципального района'
  },
  {
      header:'Наталья Шлыкова',
      content:'<p>В 2014 г. – 2015 г. в Законодательном Собрании Пермского края выполнялись работы по предоставлению сервиса автоматизации взаимодействия субъектов законотворческой деятельности Пермского края.</p><p>В результате проведенных работ, сформировано единое информационное пространство для представительных органов власти Пермского края. Депутаты получили возможность удаленного доступа к документам, сопровождающим законотворческие и нормотворческие процессы. Органы местного самоуправления оперативно получают актуальную информацию о законопроектах и законах Пермского края, аналитические материалы и планы мероприятий.</p>',
      footer:'Первый заместитель руководителя аппарата Законодательного собрания Пермского края'
  },
  {
      header:'Андрей Пьянников',
      content:'<p>Я давно смущался тем большим картонным папкам, которые нам предоставляли перед каждым Земским собранием. С внедрением этой системы необходимость в бумажных документах отпала. Все хранится в электронном виде.</p><p>Когда нам впервые рассказали об этой системе, я активно принял ее в свой обиход. Особых проблем не возникало. Все определено графическими значками, интерфейс довольно удобный. Время для работы с вопросами по Земскому собранию у меня увеличилось в разы. Эта программа мне очень помогла.</p>',
      footer:'депутат Земского собрания Ординского муниципального района.'
  },
  {
      header:'Сергей Тунев',
      content:'<p>В любом месте я могу посмотреть документы, которые меня интересуют в данный момент. Могу также посмотреть и те документы, которые будут меня интересовать потом. И самое интересное, что я могу посмотреть такие же практически документы и планы, которые наметили наши соседи в других муниципалитетах региона. Могу посмотреть документы других районов, узнать, как они развиваются и что делают. И с учетом их практики внести изменения в работу нашего Земского собрания. Раньше надо было куда-то ехать, интересоваться. А теперь можно никуда не выезжая, получить что-то полезное.</p>',
      footer:'председатель Земского собрания Верещагинского муниципального района.'
  },
  {
      header:'Иван Елохов',
      content:'<p>Процесс электронного документооборота уже не остановить. Это логично, что мы пришли к работе в электронных плоскостях. Раньше нужные документы мы вынуждены были запрашивать у специалистов Земского собрания. При решении спорных вопросов мы делали запрос. Специалисты собирали информацию и на следующем Земском собрании нам докладывали. По времени это было очень сильно растянуто. А сейчас мы можем зайти в близлежащие районы (Сива, Карагай, Очер, Сосново, Нытва) и посмотреть, как у них. Можно это сделать прямо на заседании Земского собрания. Это ускоряет принятие решения. Это очень хорошо и это правильно.</p><p>Другой пример - принятие решения о выборе Главы района. Накануне я просто зашел на сайт, пролистал назад до января наши решения о том, как мы выдвигаем и как выбираем Главу района. Оттуда поднял несколько страниц, которые мне были нужны в работе. Все. Уже не надо искать, спрашивать заранее эти бумаги. Удобно. Быстро. Действительно ускоряет процесс и это правильно.</p>',
      footer:'депутат Земского собрания Верещагинского муниципального района'
  },
  {
      header:'Татьяна Юрлова',
      content:'<p>Для меня проект больше интересен тем, что у нас есть возможность ознакомиться с опытом работы других территорий. Зачастую получается, что представительные органы принимают одинаковые решения по одним и тем же вопросам. Кто-то раньше, кто-то позднее.</p><p>В системе мы можем посмотреть, какие принимаются решения, какие вносятся поправки. Как специалисты обосновывают свои решения, какие заключения пишут мои коллеги по этим вопросам. Это очень интересно и очень полезно. И чем больше территорий будет задействовано,  тем более это будет интересно.</p>',
      footer:'председатель Контрольно-счетной палаты Осинского муниципального района'
  },
  {
      header:'Елена Толекова',
      content:'<p>Система очень доступна в использовании не только депутатам, но и нам, сотрудникам аппарата, работающим в данной системе. Плюс этой системы мы видим в экономии бумаги и времени специалистов. Сегодня у нас в аппарате работает 2 человека.</p>',
      footer:'главный специалист Земского собрания Верещагинского муниципального района'
  },
];

var aobjs = [
  {
      question:'Зачем депутату виртуальный кабинет?',
      answer:'<p>Виртуальный кабинет обеспечивает депутатам доступ к полной базе законов, законопроектов, повесток заседаний и другим документам.</p><p>Данные обновляются в режиме реального времени, соответственно, информация всегда актуальна. Нет необходимости сверять версии документов, сомневаясь в достоверности данных.</p><p>Виртуальный кабинет – это мобильное приложение. В нем можно работать как в онлайн, так и в оффлайн режиме без подключения к сети Интернет. Законодатели могут работать с документами во время поездок, иметь доступ к базе данных законов во время выездных совещаний в отдаленных районах.</p><p>Еще одна удобная функция виртуального кабинета – это возможность аннотирования документов и хранения заметок в частном облаке. Депутат может сам оставлять комментарии к документам, а также работать с заметками своих помощников.</p><p>Таким образом, у депутатов существенно увеличивается время для работы над вопросами повестки заседаний. Можно круглосуточно работать с нормативно-правовыми актами и сопроводительными документами. Работать можно как со стационарного компьютера, так и удаленно. Можно скопировать документы и работать с ними без соединения с Интернет. В любом месте можно посмотреть документы, которые интересуют в данный момент.</p>'
  },
  {
      question:'Что содержится в электронном паспорте закона?',
      answer:'<p>Электронный паспорт содержит актуальную версию самого документа, историю его изменений и все связанные с ним документы.</p><p>Паспорт закона моментально отражает любые изменения, которые произошли с документом в системе электронного документооборота. В электронном паспорте закона отражаются результаты рассмотрения и принятия постановлений и законов, подготовки заключений, аналитических записок, решений и другие процессы СЭД.<br/>Вся история изменения информации в разделах паспорта документа доступна для просмотра. Доступна также информация обо всех корректировках, которые вносились в законопроекты в ходе их принятия.</p><p>Таким образом, в распоряжении сотрудников аппарата и депутатов всегда только актуальные и действующие версии документов. Они хорошо структурированы. Ориентироваться в документах легко и удобно.</p>'
  },
  {
      question:'Как электронная повестка заседания экономит время сотрудникам аппарата?',
      answer:'<p>Электронная повестка заседания позволяет существенно упростить процедуру формирования перечня вопросов к рассмотрению. Большинство пунктов повестки формируется автоматически. В повестку попадают документы, рассмотрение которых не закончилось на предыдущем заседании, и новые документы, срок рассмотрения которых подходит по дате для текущего заседания.</p><p>С помощью этого модуля удобно не только формировать повестку, но и рассылать ее депутатам. Нет необходимости печатать пакет документов для каждого депутата, не нужно выполнять монотонную работу по рассылке файлов по электронной почте. Повестка и все сопутствующие документы автоматически отображаются в виртуальном кабинете каждого депутата.</p><p>С внедрением этого модуля уходит в прошлое огромный объем бумаг, которые приходится постоянно переделывать.</p>'
  },
  {
      question:'Автоматическое формирование протоколов заседаний – это возможно?',
      answer:'<p>Одна из самых трудоемких операций в работе сотрудников аппарата представительного органа власти – это обработка результатов заседаний и формирование протоколов. Нужно зафиксировать результаты голосования по каждому пункту повестки. Обычно это несколько десятков вопросов. Кроме того, голосование может еще быть и пофамильным. Необходимо проделать большой объем работы в сжатые сроки. Это может привести к ошибкам или искажению информации, которое совершенно недопустимо.</p><p>Программный комплекс «Нормосфера» успешно решает задачу формирования протокола по итогу заседания. Он позволяет свести ручной ввод информации к минимуму. А при использовании совместно с системами голосования и полностью автоматизировать процесс.</p>'
  },
  {
      question:'Как познакомиться с нормотворческим опытом других территорий, не вставая с рабочего места? ',
      answer:'<p>Зачастую представительные органы власти разных муниципальных образований принимают аналогичные решения по одним и тем же вопросам. В программном комплексе "Нормосфера" можно знакомиться с нормотворческой деятельностью представительных органов власти разных муниципалитетов региона.</p><p>Сотрудникам аппаратов интересно посмотреть какие решения принимаются их коллегами, какие вносятся поправки. Как специалисты обосновывают свои решения и какие заключения пишут.</p><p>Руководители аппаратов также ценят возможность увидеть опыт других территорий. Важно, что сделать это можно никуда не выезжая, а просто открыв приложение "Нормосфера", выбрав интересующую тематику и территорию.</p><p>Депутаты при обсуждении спорных вопросов иногда прямо на заседании открывают аналогичные документы других районов и смотрят, как это устроено там. Не нужно посылать запрос, ждать ответа. Информацию можно получить мгновенно. Это позволяет принимать решения более оперативно.</p><p>Таким образом, внедрение ПК «Нормосфера» позволяет создать единое информационное пространство законотворческой и нормотворческой деятельности в регионе или округе. Вся информация в системе открыта, и представительные органы власти, подключенные к системе, фактически находятся в одном информационном поле и беспрепятственно могут обмениваться актуальной информацией и лучшими практиками.</p>'
  },
  {
      question:'Зачем автоматизировать процесс подготовки к заседанию?',
      answer:'<p>В случае отсутствия автоматизации в процессе подготовки к заседанию, аналитическая и сопроводительная документация формируется, потом распечатывается, раскладывается по папкам и затем развозится депутатам.</p><p>Например, к заседанию комитета для рассмотрения законопроекта каждому депутату распечатывают в бумажном виде сам законопроект (около 20 страниц), пакет документов к законопроекту (около 8 видов документов), заключения различных организаций (по 10-15 страниц), поправки и заключения от органов местного самоуправления (всего 40 организаций).</p><p>Либо же эти документы рассылаются объемными письмами по электронной почте. В процессе подготовки к заседанию данные быстро устаревают, и процесс приходится повторять. Все это вместе делает такой способ подготовки к заседаниям очень неэффективным.</p><p>В результате внедрения ПК «Нормосфера» процесс подготовки к заседанию автоматизируется настолько, что депутаты и их помощники в любой момент времени сами могут получать актуальную и полную информацию в рамках законотворческого процесса. Повестка заседания и все сопутствующие документы автоматически отображаются в их виртуальном кабинете. И становятся доступными в том числе, через мобильные устройства.</p><p>Это позволяет осуществить переход к полностью безбумажному процессу подготовки и проведения заседаний, сэкономить время сотрудников аппарата и обеспечить депутатов актуальными версиями документов.</p>'
  },
  {
      question:'Почему сложно автоматизировать процесс законотворческой деятельности?',
      answer:'<p>Законотворческая и нормотворческая деятельность имеет свои особенности:<br/>•	сложный механизм рассмотрения и принятия законов и постановлений<br/>•	большое количество законопроектов, одновременно находящихся в работе<br/>•	большие объемы сопроводительных документов, связанных с законопроектом<br/>•	специфичный рабочий график депутатов<br/>•	одновременная работа большого количества пользователей</p><p>Обычная СЭД может решить только часть этих задач. Поэтому мы разработали специализированное решение – программный комплекс «Нормосфера».</p><p>Он сделан с учетом специфики рабочих процессов законотворческой и нормотворческой деятельности. Обеспечивает удаленную работу с документами. Настраивается под регламент конкретного представительного органа.</p><p>ПК «Нормосфера» легко интегрируется с другими системами, соответствует федеральным требованиям и разработан с учетом требований по импортзамещению ПО.</p>'
  },
  {
      question:'Какие процессы автоматизирует ПК «Нормосфера»?',
      answer:'<p>Программный комплекс «Нормосфера» позволяет полностью автоматизировать документооборот в представительных органах власти.</p><p>Помимо автоматизации работы с входящими и исходящими документами, он оптимизирует также ключевые специализированные процессы законотворческой и нормотворческой деятельности:<br/>•	внесение и подготовку к рассмотрению законопроектов<br/>•	подготовку и принятие законов, правовых актов и постановлений<br/>•	подготовку заключений, аналитических записок, планов мероприятий<br/>•	подготовку повесток, решений, протоколов, постановлений<br/>•	подготовку и обработку поправок, предложений, замечаний</p><p>В случае, если в представительном органе власти уже внедрена СЭД, то она может быть сохранена и интегрирована с комплексом «Нормосфера».</p>'
  },
  {
      question:'Как с помощью ПК «Нормосфера» организовать работу Молодежного парламента?',
      answer:'<p>Программный комплекс «Нормосфера» обеспечивает получение вопросов повесток комитетов представительного органа для рассмотрения комиссиями Молодежного парламента. Позволяет формировать повестки заседаний для различных его подразделений. Фиксировать результаты голосований, передавать решения Молодежного парламента в паспорт закона.</p><p>Интеграция с социальной сетью «ВКонтакте» обеспечивает техническую возможность для проведения заочных заседаний молодежного представительного органа.</p>'
  },
];

$("a").on('click', function(event) {
  if (this.hash !== "" && location.pathname == "/") {
    event.preventDefault();
    var hash = this.hash;
    var scrollTop = $(hash).offset().top - 74;
    $('html, body').animate({
      scrollTop: scrollTop
    }, 800);
  }
});

$(document).ready(function(){
  $(".navbar-toggler").click(function() {
    var navbar = $(".navbar-collapse");
    if (navbar.hasClass("opened")) {
      navbar.removeClass("opened");
      $("body").removeClass("navOpened");
      $(".navbar-toggler").removeClass("toggle-clicked");
    } else {
      navbar.addClass("opened");
      $("body").addClass("navOpened");
      $(".navbar-toggler").addClass("toggle-clicked");
    }
  });
  $(".nav-link").click(function() {
    $(".navbar-toggler").click();
  })


  var rootReviews = document.getElementById('reviewsItems');
  var rootFBoxes = document.createElement('div');
  rootFBoxes.style.display = 'none';
  objs.forEach(function(item,index){
      var r = document.createElement('div');
      r.setAttribute('class','review visible');
      r.setAttribute('href',`#boxData${index}`)
      var z = document.createElement('div');
      z.setAttribute('class','review');
      z.setAttribute('id',`boxData${index}`);
      var h = document.createElement('div');
      h.setAttribute('class', 'header');
      h.innerText = item.header;
      var c = document.createElement('div');
      c.setAttribute('class', 'content');
      c.innerHTML = item.content.slice(0,item.content.indexOf(' ',250)) + '...';
      var cf = document.createElement('div');
      cf.setAttribute('class', 'content');
      cf.innerHTML = item.content;
      var f = document.createElement('div');
      f.setAttribute('class', 'footer');
      f.innerText = item.footer;
      r.append(h,c);
      z.append(cf,h.cloneNode(true),f);
      rootReviews.append(r);
      rootFBoxes.append(z);
  })
  document.body.append(rootFBoxes);


  var rootReviews = document.getElementById('answersItems');
  var rootABoxes = document.createElement('div');
  rootABoxes.style.display = 'none';
  aobjs.forEach(function(item,index){
      var r = document.createElement('div');
      r.setAttribute('class','answer visible');
      r.setAttribute('href',`#answerData${index}`)
      var z = document.createElement('div');
      z.setAttribute('class','answer');
      z.setAttribute('id',`answerData${index}`);
      var h = document.createElement('div');
      h.setAttribute('class', 'header');
      h.innerText = item.question;
      var c = document.createElement('div');
      c.setAttribute('class', 'content');
      c.innerHTML = item.answer.slice(0,item.answer.indexOf(' ',250)) + '...';
      var cf = document.createElement('div');
      cf.setAttribute('class', 'content');
      cf.innerHTML = item.answer;
      r.append(h,c);
      z.append(h.cloneNode(true),cf);
      rootReviews.append(r);
      rootABoxes.append(z);
  })
  document.body.append(rootABoxes);


  // $('html').niceScroll({cursorborder:"none"});

  $('.slider').slick({
      dots: true,
      autoplay: true,
      autoplaySpeed: 2000
  });
  $('#reviewsItems').slick({
      infinite: true,
      slidesToShow: 3,
      slidesToScroll: 1,
      autoplay: false,
      autoplaySpeed: 2000,
      responsive: [{
        breakpoint: 992,
        settings: {
          slidesToShow: 1,
          slidesToScroll: 1
        }
      }]
  });
  $('#answersItems').slick({
      infinite: true,
      slidesToShow: 3,
      slidesToScroll: 1,
      autoplay: false,
      autoplaySpeed: 2000,
      responsive: [{
        breakpoint: 992,
        settings: {
          slidesToShow: 1,
          slidesToScroll: 1
        }
      }]
  });

  $('.hrefs > a').on('click',function(e){
      e.preventDefault();
      var el = $(this).attr('atrpos');
      var pos = $('#'+el).offset().top;
      $('html').getNiceScroll(0).doScrollTop(pos,500);
  })
  $('.review.visible').fancybox();
  $('.answer.visible').fancybox();
})